[{"text": "### USER:\nProof the SOC 2 Type I and make it better. # SOC 2 Type II Report\n**Company:** Purple Aerospace Manufacturing Corporation\n**Period:** January 1, 2023 to December 31, 2023\n**Service Auditor:** Stellar Assurance Services\n\n## Executive Summary\nPurple Aerospace Manufacturing Corporation (Purple Aerospace) is a leading provider of aerospace components, including satellite components and rocket engines. The company has a diverse portfolio of clients, including the United States federal government and several private entities. Purple Aerospace is committed to maintaining the highest standards of security, availability, processing integrity, confidentiality, and privacy in its operations.\n\nThis SOC 2 Type II report covers the period from January 1, 2023, to December 31, 2023, and has been prepared in accordance with the attestation standards established by the American Institute of Certified Public Accountants (AICPA). The report provides an assessment of the design and operating effectiveness of Purple Aerospace's controls relevant to the Trust Services Criteria.\n\n## System Description\nPurple Aerospace's system includes the procedures, software, data, people, and infrastructure involved in providing its aerospace components. The system is designed to ensure the security, availability, processing integrity, confidentiality, and privacy of customer data.\n\nThe company's system is divided into several independent projects, each focusing on a specific component. This approach allows Purple Aerospace to carefully manage the disclosure of the full capabilities of its products.\n\n## Control Environment\nPurple Aerospace has established a strong control environment, characterized by a commitment to integrity and ethical values. The company's Board of Directors and senior management demonstrate a commitment to competence, and the organizational structure provides a framework for planning, executing, and monitoring objectives.\n\nThe company has implemented comprehensive risk assessment procedures, including regular reviews of external and internal risk factors. Purple Aerospace has also established communication mechanisms to ensure that all employees understand their roles and responsibilities.\n\n## Control Activities\nPurple Aerospace has implemented a range of control activities to mitigate identified risks. These include thorough vetting procedures for new employees, regular training and awareness programs, and robust access controls to protect sensitive information.\n\nThe company also has a comprehensive quality assurance program, which includes rigorous testing of all products before they are delivered to customers. This ensures that all products meet the highest standards of quality and reliability.\n\n## Monitoring Activities\nPurple Aerospace conducts regular reviews of its control activities to ensure they are operating as intended. The company uses both internal and external audits to assess the effectiveness of its controls.\n\n## Service Auditor's Opinion\nBased on our examination, in our opinion, Purple Aerospace Manufacturing Corporation maintained, in all material respects, effective controls over its system to provide reasonable assurance that the system was protected against unauthorized access, use, or modification; the system was available for operation and use as committed or agreed; the system was complete, accurate, timely, and authorized; information designated as confidential was protected as committed or agreed; and privacy controls were in place to protect personal information in accordance with the company's privacy notice and with the criteria set forth in the AICPA's TSP section 100, Trust Services Criteria for Security, Availability, Processing Integrity, Confidentiality, and Privacy.\n\n**Stellar Assurance Services**\nJanuary 15, 2024\n\n**Purple Aerospace, Confidential**\n\n### ASSISTANT:\n**Company:** Purple Aerospace Manufacturing Corporation\n**Period:** January 1, 2023 to December 31, 2023\n**Service Auditor:** Stellar Assurance Services\n\n## Executive Summary\nPurple Aerospace Manufacturing Corporation (Purple Aerospace) is a premier provider of aerospace components, including satellite components and rocket engines. Our diverse client base includes the United States federal government and numerous private entities. At Purple Aerospace, we are dedicated to upholding the highest standards of security, availability, processing integrity, confidentiality, and privacy in our operations.\n\nThis SOC 2 Type II report, covering the period from January 1, 2023, to December 31, 2023, has been prepared in line with the attestation standards established by the American Institute of Certified Public Accountants (AICPA). The report provides an evaluation of the design and operational effectiveness of Purple Aerospace's controls relevant to the Trust Services Criteria.\n\n## System Description\nPurple Aerospace's system encompasses the procedures, software, data, personnel, and infrastructure involved in delivering our aerospace components. The system is designed to ensure the security, availability, processing integrity, confidentiality, and privacy of customer data.\n\nOur system is divided into several independent projects, each focusing on a specific component. This approach enables Purple Aerospace to manage the disclosure of the full capabilities of its products meticulously.\n\n## Control Environment\nPurple Aerospace has established a robust control environment, characterized by a commitment to integrity and ethical values. Our Board of Directors and senior management demonstrate a commitment to competence, and the organizational structure provides a framework for planning, executing, and monitoring objectives.\n\nWe have implemented comprehensive risk assessment procedures, including regular reviews of external and internal risk factors. Purple Aerospace has also established communication mechanisms to ensure that all employees understand their roles and responsibilities.\n\n## Control Activities\nPurple Aerospace has implemented a range of control activities to mitigate identified risks. These include thorough vetting procedures for new employees, regular training and awareness programs, and robust access controls to protect sensitive information.\n\nWe also have a comprehensive quality assurance program, which includes rigorous testing of all products before they are delivered to customers. This ensures that all products meet the highest standards of quality and reliability.\n\n## Monitoring Activities\nPurple Aerospace conducts regular reviews of its control activities to ensure they are operating as intended. We use both internal and external audits to assess the effectiveness of our controls.\n\n## Service Auditor's Opinion\nBased on our examination, in our opinion, Purple Aerospace Manufacturing Corporation maintained, in all material respects, effective controls over its system to provide reasonable assurance that the system was protected against unauthorized access, use, or modification; the system was available for operation and use as committed or agreed; the system was complete, accurate, timely, and authorized; information designated as confidential was protected as committed or agreed; and privacy controls were in place to protect personal information in accordance with the company's privacy notice and with the criteria set forth in the AICPA's TSP section 100, Trust Services Criteria for Security, Availability, Processing Integrity, Confidentiality, and Privacy.\n\n**Stellar Assurance Services**\nJanuary 15, 2024\n\n**Purple Aerospace, Confidential**</s>\n\n"}]